# CannotCreateOpeningRectangularArcWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateOpeningRectangularArcWall Property
BuiltInFailures..::..CreationFailures Class See Also
---
Creation of a Rectangular Arc Wall Opening failed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateOpeningRectangularArcWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateOpeningRectangularArcWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateOpeningRectangularArcWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace